CreamyKitten/nepu/基于STM32控制的OLED超声波测距仪系统/Code/User/OLED.c
// OLED显示驱动程序，基于I2C通信，0.96寸128x64分辨率
#include "stm32f10x.h"
#include "OLED_Font.h"
#include "main.h"

// I2C引脚定义，使用PB8(SCL)和PB9(SDA)
#define OLED_W_SCL(x)		GPIO_WriteBit(GPIOB, GPIO_Pin_8, (BitAction)(x))  // SCL时钟线
#define OLED_W_SDA(x)		GPIO_WriteBit(GPIOB, GPIO_Pin_9, (BitAction)(x))  // SDA数据线

// I2C接口初始化
void OLED_I2C_Init(void)
{
    // 使能GPIOB时钟
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
    // 配置为开漏输出模式，用于I2C通信
 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	// I2C总线空闲状态
	OLED_W_SCL(1);
	OLED_W_SDA(1);
}

// I2C通信起始信号
void OLED_I2C_Start(void)
{
	OLED_W_SDA(1);
	OLED_W_SCL(1);
	OLED_W_SDA(0);  // 当SCL为高电平时，SDA下降沿表示起始信号
	OLED_W_SCL(0);
}

// I2C通信停止信号
void OLED_I2C_Stop(void)
{
	OLED_W_SDA(0);
	OLED_W_SCL(1);
	OLED_W_SDA(1);  // 当SCL为高电平时，SDA上升沿表示停止信号
}

// I2C发送一个字节
void OLED_I2C_SendByte(uint8_t Byte)
{
	uint8_t i;
	// 按位发送数据，从最高位开始
	for (i = 0; i < 8; i++)
	{
		OLED_W_SDA(Byte & (0x80 >> i));  // 取出当前位
		OLED_W_SCL(1);                    // 产生时钟上升沿，从机读取数据
		OLED_W_SCL(0);                    // 时钟下降沿，准备发送下一位
	}
	OLED_W_SCL(1);	// 额外的一个时钟，不处理应答信号
	OLED_W_SCL(0);
}

// 写入OLED命令
void OLED_WriteCommand(uint8_t Command)
{
	OLED_I2C_Start();
	OLED_I2C_SendByte(0x78);		// OLED从机地址，写模式
	OLED_I2C_SendByte(0x00);		// 控制字节，表示写命令
	OLED_I2C_SendByte(Command); 
	OLED_I2C_Stop();
}

// 写入OLED数据
void OLED_WriteData(uint8_t Data)
{
	OLED_I2C_Start();
	OLED_I2C_SendByte(0x78);		// OLED从机地址，写模式
	OLED_I2C_SendByte(0x40);		// 控制字节，表示写数据
	OLED_I2C_SendByte(Data);
	OLED_I2C_Stop();
}

// 设置OLED光标位置
void OLED_SetCursor(uint8_t Y, uint8_t X)
{
	OLED_WriteCommand(0xB0 | Y);					//设置Y位置
	OLED_WriteCommand(0x10 | ((X & 0xF0) >> 4));	//设置X位置高4位
	OLED_WriteCommand(0x00 | (X & 0x0F));			//设置X位置低4位
}

// OLED清屏
void OLED_Clear(void)
{  
	uint8_t i, j;
	for (j = 0; j < 8; j++)
	{
		OLED_SetCursor(j, 0);
		for(i = 0; i < 128; i++)
		{
			OLED_WriteData(0x00);
		}
	}
}

// 显示单个字符
void OLED_ShowChar(uint8_t Line, uint8_t Column, char Char)
{      	
	uint8_t i;
	// 显示字符的上半部分（8x16字体的上8行）
	OLED_SetCursor((Line - 1) * 2, (Column - 1) * 8);
	for (i = 0; i < 8; i++)
	{
		OLED_WriteData(OLED_F8x16[Char - ' '][i]);
	}
	// 显示字符的下半部分（8x16字体的下8行）
	OLED_SetCursor((Line - 1) * 2 + 1, (Column - 1) * 8);
	for (i = 0; i < 8; i++)
	{
		OLED_WriteData(OLED_F8x16[Char - ' '][i + 8]);
	}
}

// 显示字符串
void OLED_ShowString(uint8_t Line, uint8_t Column, char *String)
{
	uint8_t i;
	for (i = 0; String[i] != '\0'; i++)
	{
		OLED_ShowChar(Line, Column + i, String[i]);
	}
}

// 计算X的Y次方
uint32_t OLED_Pow(uint32_t X, uint32_t Y)
{
	uint32_t Result = 1;
	while (Y--)
	{
		Result *= X;
	}
	return Result;
}

// 显示无符号数字
void OLED_ShowNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
{
	uint8_t i;
	for (i = 0; i < Length; i++)							
	{
		OLED_ShowChar(Line, Column + i, Number / OLED_Pow(10, Length - i - 1) % 10 + '0');
	}
}

// 显示有符号数字
void OLED_ShowSignedNum(uint8_t Line, uint8_t Column, int32_t Number, uint8_t Length)
{
	uint8_t i;
	uint32_t Number1;
	if (Number >= 0)
	{
		OLED_ShowChar(Line, Column, '+');
		Number1 = Number;
	}
	else
	{
		OLED_ShowChar(Line, Column, '-');
		Number1 = -Number;
	}
	for (i = 0; i < Length; i++)							
	{
		OLED_ShowChar(Line, Column + i + 1, Number1 / OLED_Pow(10, Length - i - 1) % 10 + '0');
	}
}

// 显示十六进制数
void OLED_ShowHexNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
{
	uint8_t i, SingleNumber;
	for (i = 0; i < Length; i++)							
	{
		SingleNumber = Number / OLED_Pow(16, Length - i - 1) % 16;
		if (SingleNumber < 10)
		{
			OLED_ShowChar(Line, Column + i, SingleNumber + '0');
		}
		else
		{
			OLED_ShowChar(Line, Column + i, SingleNumber - 10 + 'A');
		}
	}
}

// 显示二进制数
void OLED_ShowBinNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
{
	uint8_t i;
	for (i = 0; i < Length; i++)							
	{
		OLED_ShowChar(Line, Column + i, Number / OLED_Pow(2, Length - i - 1) % 2 + '0');
	}
}

// OLED初始化
void OLED_Init(void)
{
	uint32_t i, j;
	
	// 上电延时，等待OLED稳定
	for (i = 0; i < 1000; i++)			
	{
		for (j = 0; j < 1000; j++);
	}
	
	OLED_I2C_Init();			// 初始化I2C接口
	
	OLED_WriteCommand(0xAE);	// 关闭显示，进入配置模式
	
	// 初始化OLED各项参数
	OLED_WriteCommand(0xD5);	// 设置显示时钟分频比/振荡器频率
	OLED_WriteCommand(0x80);
	
	OLED_WriteCommand(0xA8);	// 设置多路复用率 1/64
	OLED_WriteCommand(0x3F);
	
	OLED_WriteCommand(0xD3);	// 设置显示偏移，无偏移
	OLED_WriteCommand(0x00);
	
	OLED_WriteCommand(0x40);	// 设置显示起始行为第一行
	
	OLED_WriteCommand(0xA1);	// 设置左右方向，0xA1正常 0xA0左右反置
	
	OLED_WriteCommand(0xC8);	// 设置上下方向，0xC8正常 0xC0上下反置

	OLED_WriteCommand(0xDA);	// 设置COM引脚硬件配置
	OLED_WriteCommand(0x12);
	
	OLED_WriteCommand(0x81);	// 设置对比度
	OLED_WriteCommand(0xCF);	// 设置对比度值

	OLED_WriteCommand(0xD9);	// 设置预充电周期
	OLED_WriteCommand(0xF1);

	OLED_WriteCommand(0xDB);	// 设置VCOMH电压倍率
	OLED_WriteCommand(0x30);

	OLED_WriteCommand(0xA4);	// 设置显示方式，根据GDDRAM内容显示

	OLED_WriteCommand(0xA6);	// 设置正常显示模式（1亮0灭）

	OLED_WriteCommand(0x8D);	// 使能充电泵
	OLED_WriteCommand(0x14);

	OLED_WriteCommand(0xAF);	// 开启显示
		
	OLED_Clear();				// OLED清屏
}
